Tekla.Structures.Plugins.DirectManipulation.Services.Handles.LineHandle
Represents a handle that is represented as a line segment on the model.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.LineHandle.#ctor(Tekla.BIM.DirectManipulation.Services.Interaction.ISegmentHandle)
Creates an instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Handles.LineHandle class.
nativeHandle: Underlying DM handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.LineHandle.WrappedHandle
Gets the underlying segment handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.LineHandle.Line
Gets the segment that the handle represents.